Merge pull request #1 from chanchaiws23/develop
Make Docker Compose startup self-contained
